# taps
tap 'homebrew/cask-fonts'
tap 'FelixKratz/formulae'
tap 'asmvik/formulae'

# brew formulae
brew 'mackup'
brew 'mas'
brew 'wget'
brew 'grep'
brew 'openssh'
brew 'fastfetch'
brew 'tree'
brew 'curl'
brew 'openssl'
brew 'coreutils'
brew 'moreutils'
brew 'gnu-sed'
brew 'findutils'
brew 'binutils'
brew 'dockutil'
brew 'nmap'
brew 'inetutils'
brew 'dnstracer'
brew 'ipcalc'
brew 'mtr'
brew 'speedtest'
brew 'ipinfo-cli'
brew 'yabai'
brew 'borders'
brew 'skhd'
brew 'sketchybar'
cask 'font-space-mono-nerd-font'
cask 'font-hack-nerd-font'
brew 'lsd'
brew 'bat'
brew 'jq'
cask 'sf-symbols'
brew 'spaceman'
brew 'starship'

# NetOps
cask 'docker'
cask 'cyberduck'
cask 'postman'
cask 'github'

# dev
brew 'git'
brew 'gh'
brew 'ruby'
brew 'tmux'
brew 'pipx'
brew 'zsh-autocomplete'
brew 'syntax-highlight'

# macOS apps
cask 'google-chrome'
cask 'discord'
cask 'handbrake'
cask 'yacreader'
cask 'microsoft-teams'
cask 'wireshark'
cask 'angry-ip-scanner'
cask 'the-unarchiver'
cask 'caffeine'
cask 'synergy-core'
cask 'karabiner-elements'
cask 'visual-studio-code'
cask 'microsoft-office'
cask 'displaylink'
cask 'dockdoor'
cask 'iterm2'

mas 'Hiddenbar', id: 1452453066
mas "Windows App", id: 1295203466 # app that replaced Microsoft Remote Desktop app
